# FullCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridLine..::..FullCurve Property
CurtainGridLine Class See Also
---
Retrieve the geometry curve of the curtain grid line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve FullCurve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FullCurve As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ FullCurve {
	Curve^ get ();
}
```

# See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace